{"name": "pendigits", "title": "Pendigits", "resources": [{"path": "pendigits.arff", "pathType": "local", "name": "pendigits", "format": "arff", "encoding": "ISO-8859-1"}, {"path": "pendigits.csv", "pathType": "local", "name": "pendigits", "format": "csv", "mediatype": "text/csv", "encoding": "ISO-8859-1", "dialect": {"delimiter": ",", "quoteChar": "\""}, "schema": {"fields": [{"name": "input1", "type": "number", "format": "default"}, {"name": "input2", "type": "number", "format": "default"}, {"name": "input3", "type": "number", "format": "default"}, {"name": "input4", "type": "number", "format": "default"}, {"name": "input5", "type": "number", "format": "default"}, {"name": "input6", "type": "number", "format": "default"}, {"name": "input7", "type": "number", "format": "default"}, {"name": "input8", "type": "number", "format": "default"}, {"name": "input9", "type": "number", "format": "default"}, {"name": "input10", "type": "number", "format": "default"}, {"name": "input11", "type": "number", "format": "default"}, {"name": "input12", "type": "number", "format": "default"}, {"name": "input13", "type": "number", "format": "default"}, {"name": "input14", "type": "number", "format": "default"}, {"name": "input15", "type": "number", "format": "default"}, {"name": "input16", "type": "number", "format": "default"}, {"name": "class", "type": "number", "format": "default"}], "missingValues": [""]}}], "readme": "The resources for this dataset can be found at https://www.openml.org/d/32\n\nAuthor: E. Alpaydin, Fevzi. Alimoglu  \nSource: [UCI Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Pen-Based+Recognition+of+Handwritten+Digits)  \nPlease cite:  [UCI citation policy](https://archive.ics.uci.edu/ml/citation_policy.html)\n\nPen-Based Recognition of Handwritten Digits  \nWe create a digit database by collecting 250 samples from 44 writers. The samples written by 30 writers are used for training, cross-validation and writer dependent testing, and the digits written by the other 14 are used for writer independent testing. This database is also available in the UNIPEN format.\n\nWe use a WACOM PL-100V pressure sensitive tablet with an integrated LCD display and a cordless stylus. The input and display areas are located in the same place. Attached to the serial port of an Intel 486 based PC, it allows us to collect handwriting samples. The tablet\nsends $x$ and $y$ tablet coordinates and pressure level values of the pen at fixed time intervals (sampling rate) of 100 miliseconds. \n \nThese writers are asked to write 250 digits in random order inside boxes of 500 by 500 tablet pixel resolution.  Subject are monitored only during the first entry screens. Each screen contains five boxes with the digits to be written displayed above. Subjects are told to write only inside these boxes.  If they make a mistake or are unhappy with their writing, they are instructed to clear the content of a box by using an on-screen button. The first ten digits are ignored because most writers are not familiar with this type of input devices, but subjects are not aware of this. \n \nIn our study, we use only ($x, y$) coordinate information. The stylus pressure level values are ignored. First we apply normalization to make our representation invariant to translations and scale distortions. The raw data that we capture from the tablet consist of integer values between 0 and 500 (tablet input box resolution). The new coordinates are such that the coordinate which has the maximum range varies between 0 and 100. Usually $x$ stays in this range, since most characters are taller than they are wide.  \n\n### Attribute information  \n\nIn order to train and test our classifiers, we need to represent digits as constant length feature vectors. A commonly used technique leading to good results is resampling the ( x_t, y_t) points. Temporal resampling (points regularly spaced in time) or spatial resampling (points regularly spaced in arc length) can be used here. Raw point data are already regularly spaced in time but the distance between them is variable. Previous research showed that spatial resampling to obtain a constant number of regularly spaced points on the trajectory yields much better performance, because it provides a better alignment between points. Our resampling algorithm uses simple linear interpolation between pairs of points. The resampled digits are represented as a sequence of T points ( x_t, y_t )_{t=1}^T, regularly spaced in arc length, as opposed to the input sequence, which is regularly spaced in time.\n \nSo, the input vector size is 2*T, two times the number of points resampled. We considered spatial resampling to T=8,12,16 points in our experiments and found that T=8 gave the best trade-off between accuracy and complexity.\n \nThe way we used the dataset was to use first half of training for actual training, one-fourth for validation and one-fourth for writer-dependent testing. The test set was used for writer-independent testing and is the actual quality measure.\n", "description": "The resources for this dataset can be found at https://www.openml.org/d/32\n\nAuthor: E. Alpaydin, Fev", "licenses": [{"name": "ODC-PDDL", "path": "http://opendatacommons.org/licenses/pddl/", "title": "Open Data Commons Public Domain Dedication and License"}]}