{
   "name": "jm1",
   "title": "Jm1",
   "resources": [
      {
         "path": "jm1.csv",
         "pathType": "local",
         "name": "jm1",
         "format": "csv",
         "mediatype": "text/csv",
         "encoding": "ISO-8859-1",
         "dialect": {
            "delimiter": ",",
            "quoteChar": "\""
         },
         "schema": {
            "fields": [
               {
                  "name": "loc",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "v(g)",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "ev(g)",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "iv(g)",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "n",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "v",
                  "type": "any",
                  "format": "default"
               },
               {
                  "name": "l",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "d",
                  "type": "any",
                  "format": "default"
               },
               {
                  "name": "i",
                  "type": "any",
                  "format": "default"
               },
               {
                  "name": "e",
                  "type": "any",
                  "format": "default"
               },
               {
                  "name": "b",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "t",
                  "type": "any",
                  "format": "default"
               },
               {
                  "name": "lOCode",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "lOComment",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "lOBlank",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "locCodeAndComment",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "uniq_Op",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "uniq_Opnd",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "total_Op",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "total_Opnd",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "branchCount",
                  "type": "number",
                  "format": "default"
               },
               {
                  "name": "defects",
                  "type": "boolean",
                  "format": "default"
               }
            ],
            "missingValues": [
               ""
            ]
         }
      },
      {
         "path": "jm1.arff",
         "pathType": "local",
         "name": "jm1",
         "format": "arff",
         "encoding": "ISO-8859-1"
      }
   ],
   "readme": "The resources for this dataset can be found at https://www.openml.org/d/1053\n\nAuthor: [Mike Chapman, Galaxy Global Corporation](Robert.Chapman@ivv.nasa.gov)  \nSource: [PROMISE Repository](http://promise.site.uottawa.ca/SERepository)  \nPlease cite: please follow the acknowledgment guidelines posted on [the PROMISE repository web page](http://promise.site.uottawa.ca/SERepository).  \n\nThis is a PROMISE data set made publicly available in order to encourage repeatable, verifiable, refutable, and/or improvable predictive models of software engineering.\n\nIf you publish material based on PROMISE data sets then, please follow the acknowledgment guidelines posted on [the PROMISE repository web page](http://promise.site.uottawa.ca/SERepository).\n\n## Title/Topic\nJM1/software defect prediction\n\n\n## Sources\n* Creators:  NASA, then the NASA Metrics Data Program, http://mdp.ivv.nasa.gov. \n* Contacts: \n  * Mike Chapman, Galaxy Global Corporation (Robert.Chapman@ivv.nasa.gov) +1-304-367-8341\n  * Pat Callis, NASA, NASA project manager for MDP (Patrick.E.Callis@ivv.nasa.gov) +1-304-367-8309\n\n* Donor: Tim Menzies (tim@barmag.net)\n\n* Date:  December 2nd, 2004\n\n## Past usage\n_How Good is Your Blind Spot Sampling Policy?_; 2003; Tim Menzies and Justin S. Di Stefano; 2004 IEEE Conference on High Assurance Software Engineering (http://menzies.us/pdf/03blind.pdf).\n\n### Results:\n* Very simple learners (ROCKY) perform as well in this domain as more sophisticated methods (e.g. J48, model trees, model trees) for predicting detects\n* Many learners have very low false alarm rates.\n* Probability of detection (PD) rises with effort and rarely rises above it.\n* High PDs are associated with high PFs (probability of failure)\n* PD, PF, effort can change significantly while accuracy remains essentially stable\n* With two notable exceptions, detectors learned from one data set (e.g. KC2) have nearly they same properties when applied to another (e.g. PC2, KC2). Exceptions:\n* LinesOfCode measures generate wider inter-data-set variances;\n* Precision's inter-data-set variances vary wildly\n\n_\"Assessing Predictors of Software Defects\"_, T. Menzies and J. DiStefano and A. Orrego and R. Chapman, 2004,\nProceedings, workshop on Predictive Software Models, Chicago, Available from http://menzies.us/pdf/04psm.pdf.\n\n### Results:\n* From JM1, Naive Bayes generated PDs of 25% with PF of 20%\n* Naive Bayes out-performs J48 for defect detection\n* When learning on more and more data, little improvement is seen after processing 300 examples.\n* PDs are much higher from data collected below the sub-sub-system level.\n* Accuracy is a surprisingly uninformative measure of success for a defect detector. Two detectors with the same accuracy can have widely varying PDs and PFs.\n\n## Relevant information\n* JM1 is written in \"C\" and is a real-time predictive ground system: Uses simulations to generate predictions\n* Data comes from McCabe and Halstead features extractors of source code.  These features were defined in the 70s in an attempt to objectively characterize code features that are associated with software quality. The nature of association is under dispute.\n\nNotes on McCabe and Halstead follow.\n\n* The McCabe and Halstead measures are \"module\"-based where a \"module\" is the smallest unit of functionality. In C or Smalltalk, \"modules\" would be called \"function\" or \"method\" respectively.\n\n* Defect detectors can be assessed according to the following measures:\n\n    module actually has defects\n    +-------------+------------+\n    |     no      |     yes    |\n    +-----+-------------+------------+\n    classifier predicts no defects |  no |      a      |      b     |\n    +-----+-------------+------------+\n    classifier predicts some defects | yes |      c      |      d     |\n    +-----+-------------+------------+\n\n\n    accuracy                   = acc          = (a+d)/(a+b+c+d\n    probability of detection   = pd  = recall = d/(b+d)\n    probability of false alarm = pf           = c/(a+c)\n    precision                  = prec         = d/(c+d)\n    effort                     = amount of code selected by detector = (c.LOC + d.LOC)/(Total LOC)\n\n\nIdeally, detectors have high PDs, low PFs, and low effort. This ideal state rarely happens:\n\n* PD and effort are linked. The more modules that trigger the detector, the higher the PD. However, effort also gets increases\n* High PD or low PF comes at the cost of high PF or low PD (respectively). This linkage can be seen in a standard receiver operator curve (ROC).  Suppose, for example, LOC> x is used as the detector (i.e. we assume large modules have more errors). LOC > x represents a family of detectors. At x=0, EVERY module is predicted to have errors. This detector has a high PD but also a high false alarm rate. At x=0, NO module is predicted to have errors. This detector has a low false alarm rate but won't detect anything at all. At 0 but does not reach it.\n* The line pf=pd on the above graph represents the \"no information\" line. If pf=pd then the detector is pretty useless. The better the detector, the more it rises above PF=PD towards the \"sweet spot\".\n\nNOTES ON MCCABE/HALSTEAD\n========================\nMcCabe argued that code with complicated pathways are more error-prone.  His metrics therefore reflect the pathways within a code module.\n\n    @Article{mccabe76,\n    title  = \"A Complexity Measure\",\n    author  = \"T.J. McCabe\",\n    pages  = \"308--320\",\n    journal = \"IEEE Transactions on Software Engineering\",\n    year  = \"1976\",\n    volume  = \"2\",\n    month  = \"December\",\n    number  = \"4\"}\n\nHalstead argued that code that is hard to read is more likely to be fault prone. Halstead estimates reading complexity by counting the number of concepts in a module; e.g. number of unique operators.\n\n    @Book{halstead77,\n    Author    = \"M.H. Halstead\",\n    Title    = \"Elements of Software Science\",\n    Publisher = \"Elsevier \",\n    Year    = 1977}\n\nWe study these static code measures since they are useful, easy to use, and widely used:\n\n* USEFUL: E.g. this data set can generate highly accurate predictors for defects\n* EASY TO USE: Static code measures (e.g. lines of code, the McCabe/Halstead measures) can be automatically and cheaply collected.\n* WIDELY USED: Many researchers use static measures to guide software quality predictions (see the reference list in the above \"blind spot\" paper. Verification and validation (V\\&V) textbooks advise using static code complexity measures to decide which modules are worthy of manual inspections.  Further, we know of several large government software contractors that won't review software modules _unless_ tools like McCabe predict that they are fault prone.  Hence, defect detectors have a major economic impact when they may force programmers to rewrite code.\n\nNevertheless, the merits of these metrics has been widely criticized.  Static code measures are hardly a complete characterization of the internals of a function. Fenton offers an insightful example where the same functionality is achieved using different programming language constructs resulting in different static measurements for that module. Fenton uses this example to argue the uselessness of static code measures.\n\n    @Book{fenton97,\n    author    = \"N.E. Fenton and S.L. Pfleeger\",\n    title     = {Software metrics: a Rigorous \\& Practical Approach},\n    publisher = {International Thompson Press},\n    year      = {1997}}\n\nAn alternative interpretation of Fenton's example is that static measures can never be a definite and certain indicator of the presence of a fault.  Rather, defect detectors based on static measures are best viewed as probabilistic statements that the frequency of faults tends to increase in code modules that trigger the detector.  By definition, such probabilistic statements will are not categorical claims with some a non-zero false alarm rate. The research challenge for data miners is to ensure that these false alarms do not cripple their learned theories.\n\nThe McCabe metrics are a collection of four software metrics: essential complexity, cyclomatic complexity, design complexity and LOC, Lines of Code.\n\n* Cyclomatic Complexity, or \"v(G)\", measures the number of \"linearly independent paths\". A set of paths is said to be linearly independent if no path in the set is a linear combination of any other paths in the set through a program's \"flowgraph\". A flowgraph is a directed graph where each node corresponds to a program statement, and each arc indicates the flow of control from one statement to another. \"v(G)\" is calculated by \"v(G) = e - n + 2\" where \"G\" is a program's flowgraph, \"e\" is the number of arcs in the flowgraph, and \"n\" is the number of nodes in the flowgraph. The standard McCabes rules (\"v(G)\">10), are used to identify fault-prone module.\n* Essential Complexity, or \"ev(G)$\" is the extent to which a flowgraph can be \"reduced\" by decomposing all the subflowgraphs of $G$ that are \"D-structured primes\". Such \"D-structured primes\" are also sometimes referred to as \"proper one-entry one-exit subflowgraphs\" (for a more thorough discussion of D-primes, see the Fenton text referenced above). \"ev(G)\" is calculated using \"ev(G)= v(G) - m\" where $m$ is the number of subflowgraphs of \"G\" that are D-structured primes.\n* Design Complexity, or \"iv(G)\", is the cyclomatic complexity of a module's reduced flowgraph.  The flowgraph, \"G\", of a module is reduced to eliminate any complexity which does not influence the interrelationship between design modules.  According to McCabe, this complexity measurement reflects the modules calling patterns to its immediate subordinate modules.\n* Lines of code is measured according to McCabe's line counting conventions.\n\nThe Halstead falls into three groups: the base measures, the derived measures, and lines of code measures.\n\n* Base measures:\n  * mu1             = number of unique operators\n  * mu2             = number of unique operands\n  * N1              = total occurrences of operators\n  * N2              = total occurrences of operands\n  * length     = N  = N1 + N2\n  * vocabulary = mu = mu1 + mu2\n  * Constants set for each function:\n  * mu1' =  2 = potential operator count (just the function name and the \"return\" operator)\n  * mu2'      = potential operand count. (the number of arguments to the module)\n\nFor example, the expression \"return max(w+x,x+y)\" has \"N1=4\" operators \"return, max, +,+)\", \"N2=4\" operands (w,x,x,y), \"mu1=3\" unique operators (return, max,+), and \"mu2=3\" unique operands (w,x,y).\n\n* Derived measures:\n  * P = volume = V = N * log2(mu) (the number of mental comparisons needed to write\na program of length N)\n  * V* = volume on minimal implementation = (2 + mu2')*log2(2 + mu2')\n  * L  = program length = V*/N\n  * D  = difficulty = 1/L\n  * L' = 1/D\n  * I  = intelligence = L'*V'\n  * E  = effort to write program = V/L\n  * T  = time to write program = E/18 seconds\n\n## Number of instances\n10885\n\n## Number of attributes\n22 (5 different lines of code measure, 3 McCabe metrics, 4 base Halstead measures, 8 derived Halstead measures, a branch-count, and 1 goal field)\n\n## Attribute Information\n1. loc             : numeric % McCabe's line count of code\n2. v(g)            : numeric % McCabe \"cyclomatic complexity\"\n3. ev(g)           : numeric % McCabe \"essential complexity\"\n4. iv(g)           : numeric % McCabe \"design complexity\"\n5. n               : numeric % Halstead total operators + operands\n6. v               : numeric % Halstead \"volume\"\n7. l               : numeric % Halstead \"program length\"\n8. d               : numeric % Halstead \"difficulty\"\n9. i               : numeric % Halstead \"intelligence\"\n10. e               : numeric % Halstead \"effort\"\n11. b               : numeric % Halstead\n12. t               : numeric % Halstead's time estimator\n13. lOCode          : numeric % Halstead's line count\n14. lOComment       : numeric % Halstead's count of lines of comments\n15. lOBlank         : numeric % Halstead's count of blank lines\n16. lOCodeAndComment: numeric\n17. uniq_Op         : numeric % unique operators\n18. uniq_Opnd       : numeric % unique operands\n19. total_Op        : numeric % total operators\n20. total_Opnd      : numeric % total operands\n21: branchCount     : numeric % of the flow graph\n22. defects         : {false,true} % module has/has not one or more reported defects\n\n## Missing attributes\nNone\n\n## Class Distribution\nThe class value (defects) is discrete\nfalse: 2106 = 19.35%\ntrue:  8779 = 80.65%",
   "description": "The resources for this dataset can be found at https://www.openml.org/d/1053\n\nAuthor: [Mike Chapman,",
   "licenses": [
      {
         "name": "ODC-PDDL",
         "path": "http://opendatacommons.org/licenses/pddl/",
         "title": "Open Data Commons Public Domain Dedication and License"
      }
   ]
}